# schedule_data.py

SCHEDULE = {
    "101": {
        "Monday": ["Математика — 9:00", "Физика — 11:00"],
        "Tuesday": ["Программирование — 10:00"],
        "Wednesday": [],
        "Thursday": [],
        "Friday": [],
        "Saturday": []
    },
    "102": {
        "Monday": ["Зоология — 13:45"],
        "Tuesday": ["История России — 13:45", "Основы РФ гос-ва — 17:15"],
        "Wednesday": ["Основы РФ гос-ва — 9:45"],
        "Thursday": ["Технологии поиска — 8:00", "Технологии поиска — 9:45"],
        "Friday": ["Химия — 9:45", "Ботаника — 9:45"],
        "Saturday": []
    },
    # Добавь остальные группы по аналогии
}

LESSON_TIMES = {
    1: "8:00-9:35",
    2: "9:45-11:20",
    3: "11:30-13:05",
    4: "13:45-15:20",
    5: "15:30-17:05",
    6: "17:15-18:50",
    7: "19:00-20:35"
}
